# Machine Learning Foundation

## Section 1, Part a: Reading Data

In [2]:
# Imports
import sqlite3 as sq3
import pandas.io.sql as pds
import pandas as pd

In [3]:
# Initialize path to SQLite database

path = '../data/classic_rock.db'
con = sq3.Connection(path)

In [6]:
# Write query

query = '''
SELECT * 
FROM rock_songs;
'''

In [12]:
# Execute the query

observations = pds.read_sql(query, con)
observations.head(1)

        Artist  Release_Year  num_songs  avg_plays
0  The Beatles        1967.0         23   6.565217

In [20]:
all_ts = pd.read_sql('SELECT* FROM sqlite_master',con)

In [21]:
all_ts

,type,name,tbl_name,rootpage,sql
0,table,rock_songs,rock_songs,2,"CREATE TABLE ""rock_songs"" (\n""Song"" TEXT,\n ""..."
1,table,rock_plays,rock_plays,4,"CREATE TABLE ""rock_plays"" (\n""SONG RAW"" TEXT,\..."

In [22]:
all_ts['tbl_name'].to_list()

['rock_songs', 'rock_plays']

In [23]:
# We can also run any supported SQL query

# Write query
allstarquery = '''
SELECT *  
    FROM rock_plays
    
'''

In [29]:
# Execute the query
observations_generator = pds.read_sql(allstarquery,
                            con,
                            coerce_float=True, # Doesn't efefct this dataset, because floats were correctly parsed
                            parse_dates=['Release_Year'], # Parse `Release_Year` as a date
                            chunksize=5 # Allows for streaming results as a series of shorter tables
                           )

In [34]:
# We can also run any supported SQL query

# Write query
query = '''
SELECT *  
    FROM rock_plays
'''

In [58]:
# Execute query
observations = pds.read_sql(query, con)
playdf = observations.copy()
playdf.columns
playdf.head()

,SONG RAW,Song Clean,ARTIST RAW,ARTIST CLEAN,CALLSIGN,TIME,UNIQUE_ID,COMBINED,First?,date_time,day_of_week
0,Caught Up In (live),Caught Up in You,.38 Special,.38 Special,KGLK,1402943314,KGLK1536,Caught Up in You by .38 Special,1,2014-06-16 18:28:34,0
1,Caught Up In You,Caught Up in You,.38 Special,.38 Special,KGB,1403398735,KGB0260,Caught Up in You by .38 Special,0,2014-06-22 00:58:55,6
2,Caught Up In You,Caught Up in You,.38 Special,.38 Special,KGB,1403243924,KGB0703,Caught Up in You by .38 Special,0,2014-06-20 05:58:44,4
3,Caught Up in You,Caught Up in You,.38 Special,.38 Special,KGLK,1403470732,KGLK0036,Caught Up in You by .38 Special,0,2014-06-22 20:58:52,6
4,Caught Up in You,Caught Up in You,.38 Special,.38 Special,KGLK,1403380737,KGLK0312,Caught Up in You by .38 Special,0,2014-06-21 19:58:57,5

In [66]:
over100plays = pd.DataFrame(playdf['SONG RAW'].value_counts().loc[playdf['SONG RAW'].value_counts()>100])
over100plays.head()

                             SONG RAW
Sweet Emotion                     126
Dream On                          126
You Shook Me All Night Long       122
Come Together                     115
Tom Sawyer                        110

In [67]:
top3allstars = over100plays.copy()

In [71]:
top3allstars.reset_index()

                         index  SONG RAW
0                Sweet Emotion       126
1                     Dream On       126
2  You Shook Me All Night Long       122
3                Come Together       115
4                   Tom Sawyer       110
5            Bohemian Rhapsody       109
6            Sharp Dressed Man       105
7                    Barracuda       104
8                     Renegade       101

In [78]:
top3allstars = top3allstars.reset_index().rename(columns={'index':'SongTitle', 'SONG RAW':'NumPlays'})

In [81]:
top3allstars.index += 1

In [85]:
top3allstars = top3allstars.reset_index().rename(columns={'index':'Rank'})

In [88]:
top3df = pd.DataFrame(top3allstars.loc[top3allstars['Rank']<4])

In [89]:
top3df

   Rank                    SongTitle  NumPlays
0     1                Sweet Emotion       126
1     2                     Dream On       126
2     3  You Shook Me All Night Long       122

In [91]:
#top3df.to_csv('../res/top3allstars.csv')